app/views/academic_focuses/_form.html.erb

SELECT "academic_focus_types".* FROM "academic_focus_types"
---
		<%= f.label :academic_focus_type_id %><br />
		<%= f.collection_select :academic_focus_type_id, AcademicFocusType.all, :id, :name %>

SELECT "departments".* FROM "departments"
---
		<%= f.label :department_id %><br />
		<%= f.collection_select :department_id, Department.all, :id, :name %>