app/views/financial_assistance_options/_form.html.erb

			<%= f.label :financial_assistance_option_type_id %>
			<%= f.collection_select :financial_assistance_option_type_id, FinancialAssistanceOptionType.all, :id, :name, {}, {:class => 'chosen'} %>
---
SELECT "financial_assistance_option_types".* FROM "financial_assistance_option_types"