app/views/internships/_form.html.erb

SELECT "provider_contacts".* FROM "provider_contacts"
SELECT "providers".* FROM "providers"
---
/*
	$(function(){
		$("#internship_provider_id").change(function(){
			$.ajax({
				url: '/provider_contacts.json',
				data: {"provider_id":$("#internship_provider_id").val()},
				dataType: 'json',
				success: function(data){
					$("#internship_provider_contact_id").html('');
					var provider_contact = $("#internship_provider_contact_id").val();
					$.each(data, function(){
						var selected = '';
						if(provider_contact == this.provider_contact.id){
							selected = 'selected="selected"';
						}
						$("#internship_provider_contact_id").append(
							'<option value="' + this.provider_contact.id + '" ' + selected + '>'
							+ this.provider_contact.name + '</option>'
						);
					});
				}
			});

SELECT "academic_contacts".* FROM "academic_contacts"
---
				<div class="input_group">
					<%= f.collection_select :academic_contact_id, AcademicContact.all, :id, :name, {}, {:class => 'chosen'} %>