app/controllers/academic_focuses_controller.rb

  def index
    @academic_focuses = AcademicFocus.where("name like ?", "%#{params[:q]}%")

    respond_to do |format|
      format.html # index.html.erb
      format.xml {render :xml => @academic_focuses}
      format.json  {
        array = Array.new
    		@academic_focuses.each do |object|
---
SELECT "academic_focuses".* FROM "academic_focuses"

  def show
    @academic_focus = AcademicFocus.find(params[:id])
---
SELECT "academic_focuses".* FROM "academic_focuses" WHERE "academic_focuses"."id" = 532 LIMIT 1

  def create
    @academic_focus = AcademicFocus.new(params[:academic_focus])

    respond_to do |format|
      if @academic_focus.save
---
INSERT INTO "academic_focuses" ("created_at", "name", "academic_focus_type_id", "department_id", "updated_at") VALUES ('2011-05-19 05:17:03.182772', 'American Studies', 31, 100, '2011-05-19 05:17:03.182772')