app/controllers/academic_contacts_controller.rb

SELECT "academic_contacts".* FROM "academic_contacts"
---
  def index
    @academic_contacts = AcademicContact.all

SELECT "academic_contacts".* FROM "academic_contacts" WHERE "academic_contacts"."id" = 162 LIMIT 1
---
  def show
    @academic_contact = AcademicContact.find(params[:id])