app/controllers/academic_focus_types_controller.rb

  def index
    @academic_focus_types = AcademicFocusType.all
---
SELECT "academic_focus_types".* FROM "academic_focus_types"