app/controllers/colleges_controller.rb

SELECT "colleges".* FROM "colleges"
---
  def index
    @colleges = College.all