app/controllers/departments_controller.rb

  def index
    @departments = Department.all
---
SELECT "departments".* FROM "departments"