app/controllers/financial_assistance_option_types_controller.rb

SELECT "financial_assistance_option_types".* FROM "financial_assistance_option_types"
---
  def index
    @financial_assistance_option_types = FinancialAssistanceOptionType.all