app/controllers/financial_assistance_options_controller.rb

SELECT "financial_assistance_options".* FROM "financial_assistance_options"
---
  def index
    @financial_assistance_options = FinancialAssistanceOption.all