app/controllers/industries_controller.rb

  def index
    @industries = Industry.all
---
SELECT "industries".* FROM "industries"