app/controllers/internship_instances_controller.rb

SELECT "internship_instances".* FROM "internship_instances"
---
  def index
    @internship_instances = InternshipInstance.all