app/controllers/internships_controller.rb

SELECT "internships".* FROM "internships"
---
  def index
    @internships = Internship.all

SELECT "providers".* FROM "providers" WHERE ("providers".internship_id = 13) LIMIT 1
---
          @internships = @internships.where("languages.id IN (?)", params[:languages].split(',')) if params[:languages] != 'null'
          @internships = @internships.where("fields.id IN (?)", params[:fields].split(',')) if params[:fields] != 'null'
          @internships = @internships.where("fields.industry_id IN (?)", params[:industries].split(',')) if params[:industries] != 'null'
          @internships = @internships.where("internships.provider_id IN (?)", params[:providers].split(',')) if params[:providers] != 'null'