app/controllers/providers_controller.rb

  def index
    @providers = Provider.all
---
SELECT "providers".* FROM "providers"

  def show
    @provider = Provider.find(params[:id])
---
SELECT "providers".* FROM "providers" WHERE "providers"."id" = 1 LIMIT 1

  def create
    @provider = Provider.new(params[:provider])

    respond_to do |format|
      if @provider.save
---
INSERT INTO "providers" ("website", "notes", "created_at", "agreement_on_file", "name", "bio", "provider_type_id", "updated_at") VALUES ('none', '', '2011-05-19 21:52:58.082647', 'f', 'unspecified', 'This is is a fake provider', NULL, '2011-05-19 21:52:58.082647')