app/controllers/states_controller.rb

SELECT "states".* FROM "states"
---
  def index
    @states = State.all