app/views/fields/_form.html.erb

			<%= f.label :industry_id %>
			<%= f.collection_select :industry_id, Industry.all, :id, :name, {}, {:class => 'chosen'} %>
---
SELECT "industries".* FROM "industries"